#pragma once

#include <string>
using namespace std;

#include "ConfigCenterDef.h"
#include "RegistryEditor.h"

/******************************************************************************
设置中心类
功能：
	提供设置信息，并提供设置信息相关操作。
作者：
	佳也 2623168833 jaye8090@qq.com
时间：
	2013-11-20 到 2013-12-14
******************************************************************************/
class CConfigCenter
{
public:
	CConfigCenter(ConfigCenter::PFNPutTip pfnPutTip = NULL
		, void * pThis = NULL);

	~CConfigCenter(void);

	/**************************************************************************
	初始化
	**************************************************************************/
	void Init(void);

//基本接口
public:
	/**************************************************************************
	加锁
	**************************************************************************/
	void Lock(void);

	/**************************************************************************
	解锁
	**************************************************************************/
	void Unlock(void);

	/**************************************************************************
	加载设置
	**************************************************************************/
	void LoadConfig(void);

	/**************************************************************************
	保存设置
	**************************************************************************/
	void SaveConfig(void);

//外部属性
public:
	CString		strExeFileName;		//EXE文件名
	CString		strPort;			//端口号
	BOOL		bStartupRun;		//开机运行

//内部操作
private:
	/**************************************************************************
	获取EXE文件名
	返回：
		EXE文件名
	**************************************************************************/
	CString _GetExeFileName(void);

	/**************************************************************************
	填写默认设置信息
	**************************************************************************/
	void _FillDefaultConfig(void);

	/**************************************************************************
	输出提示
	参数：
		strTip		提示
		iErr		错误码
		strErr		错误串
	**************************************************************************/
	void _PutTip(string strTip, int iErr = 0, string strErr = "");

//内部数据
private:
	ConfigCenter::PFNPutTip		m_pfnPutTip;		//输出提示回调函数
	void						* m_pThis;			//回调this指针

	CCriticalSection		m_csLock;		//互斥锁

	CRegistryEditor		m_RegistryEditor;		//注册表编辑
};