#pragma once

#include <string>
using namespace std;

#include "NetMonitorDef.h"

class CSocksProxyDlg;

/******************************************************************************
网络监视类
功能：
	监视并显示网速、流量等信息。
作者：
	佳也 2623168833 jaye8090@qq.com
时间：
	2016-2-15 到 2016-2-17
******************************************************************************/
class CNetMonitor
{
public:
	CNetMonitor(NetMonitor::PFNPutTip pfnPutTip = NULL, void * pThis = NULL);

	~CNetMonitor(void);

	/**************************************************************************
	初始化
	说明：
		此接口是线程安全的
	参数：
		pMainWnd	主窗口
	**************************************************************************/
	void Init(CSocksProxyDlg * pMainWnd);

//基本接口
public:
	/**************************************************************************
	添加数据
	说明：
		此接口是线程安全的
	参数：
		uiDataSize		数据大小
	**************************************************************************/
	void AddData(unsigned int uiDataSize);

	/**************************************************************************
	停止
	说明：
		此接口是线程安全的
	**************************************************************************/
	void Stop(void);

//内部操作
private:
	/**************************************************************************
	监视线程
	**************************************************************************/
	static UINT _threadMonitor(LPVOID pParam);

	/**************************************************************************
	监视
	**************************************************************************/
	void _Monitor(void);

	/**************************************************************************
	获取网速字符串
	参数：
		uiNetSpeed		网速
	返回：
		网速字符串
	**************************************************************************/
	CString _GetNetSpeedStr(unsigned int uiNetSpeed);

	/**************************************************************************
	获取流量字符串
	参数：
		uiTraffic		流量
	返回：
		流量字符串
	**************************************************************************/
	CString _GetTrafficStr(unsigned __int64 uiTraffic);

	/**************************************************************************
	输出提示
	参数：
		strTip		提示
		iErr		错误码
		strErr		错误串
	**************************************************************************/
	void _PutTip(string strTip, int iErr = 0, string strErr = "");

//内部数据
private:
	NetMonitor::PFNPutTip		m_pfnPutTip;		//输出提示回调函数
	void						* m_pThis;			//回调this指针

	CSocksProxyDlg		* m_pMainWnd;		//主窗口指针

	CCriticalSection		m_csLock;		//互斥锁

	unsigned int			m_uiNetSpeed;		//网速
	unsigned __int64		m_uiTraffic;		//流量

	CEvent		m_eventStop;		//停止事件
	CEvent		m_eventExit;		//退出事件
};