#pragma once

#include <string>
using namespace std;

#include "RegistryEditorDef.h"

/******************************************************************************
注册表编辑类
功能：
	对注册表进行读取和写入操作
作者：
	佳也 2623168833 jaye8090@qq.com
时间：
	2015-4-27 到 2015-4-28
******************************************************************************/
class CRegistryEditor
{
public:
	CRegistryEditor(RegistryEditor::PFNPutTip pfnPutTip = NULL
		, void * pThis = NULL);

	~CRegistryEditor(void);

//基本接口
public:
	/**************************************************************************
	设置键
	参数：
		hKey			根键
		strSubKey		子键
	**************************************************************************/
	void SetKey(HKEY hKey, CString strSubKey);

	/**************************************************************************
	读取
	参数：
		strKeyValue		键值
		strData			输出值。数据。
	**************************************************************************/
	void Read(CString strKeyValue, CString & strData);

	/**************************************************************************
	读取
	参数：
		strKeyValue		键值
		iData			输出值。数据。
	**************************************************************************/
	void Read(CString strKeyValue, int & iData);

	/**************************************************************************
	读取
	参数：
		strKeyValue		键值
		uiData			输出值。数据。
	**************************************************************************/
	void Read(CString strKeyValue, UINT & uiData);

	/**************************************************************************
	写入
	参数：
		strKeyValue		键值
		strData			数据
	**************************************************************************/
	void Write(CString strKeyValue, CString strData);

	/**************************************************************************
	写入
	参数：
		strKeyValue		键值
		iData			数据
	**************************************************************************/
	void Write(CString strKeyValue, int iData);

	/**************************************************************************
	删除值
	参数：
		strKeyValue		键值
	**************************************************************************/
	void DelValue(CString strKeyValue);

//内部操作
public:
	/**************************************************************************
	打开键
	**************************************************************************/
	void _OpenKey(void);

	/**************************************************************************
	关闭键
	**************************************************************************/
	void _CloseKey(void);

	/**************************************************************************
	输出提示信息
	参数：
		strTip		提示信息
		iErr		错误码
		strErr		错误串
	**************************************************************************/
	void _PutTip(string strTip, int iErr = 0, string strErr = "");

//内部数据
private:
	RegistryEditor::PFNPutTip		m_pfnPutTip;		//输出提示回调函数
	void							* m_pThis;			//回调this指针

	HKEY		m_hKey;				//根键
	CString		m_strSubKey;		//子键
	HKEY		m_handle;			//句柄
};